{
  "comics": [
    {
      "id": "1",
      "image": "https://rukminim2.flixcart.com/image/416/416/l26hdow0/book/c/w/l/a-dance-with-dragons-original-imagdh67h4azmdmm.jpeg?q=70",
      "title": "A Dance With Dragons",
      "genre": "Epic Fantasy",
      "author": "R.R. Martin",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 486,
      "series": "A Song of Ice and Fire",
      "publisher": "Bantam Spectra (US) / Harper Voyager (UK)",
      "pages": "1,040 pages",
      "description": "A Dance With Dragons is the fifth book in the A Song of Ice and Fire series by George R.R. Martin. The book continues the epic fantasy story set in the land of Westeros and Essos, featuring political intrigue, battles, and complex character arcs. As the war for the Iron Throne intensifies, Daenerys Targaryen, the Mother of Dragons, seeks to reclaim her birthright and rule over the Seven Kingdoms. Meanwhile, Jon Snow faces the challenges of leadership at the Wall, while also confronting the enigmatic threat of the White Walkers beyond the Wall."
    },
    {
      "id": "2",
      "image": "https://rukminim2.flixcart.com/image/612/612/l0sgyvk0/book/a/6/z/a-game-of-thrones-original-imagcgcy4hjud7x9.jpeg?q=70",
      "title": "Game Of Thrones",
      "genre": "Fantasy , politics",
      "author": "R.R. Martin",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 479,
      "series": "A Song of Ice and Fire",
      "publisher": "Bantam Spectra (US) / Harper Voyager (UK)",
      "pages": "848 pages",
      "description": "Game Of Thrones is the first book in the A Song of Ice and Fire series by George R.R. Martin. It introduces readers to the sprawling fantasy world of Westeros, filled with noble houses, dragons, and a struggle for power. The story follows multiple characters, including Eddard Stark, a noble lord who becomes embroiled in a web of political intrigue after he is appointed Hand of the King. As the Seven Kingdoms are divided by civil war and shifting alliances, dark forces begin to stir beyond the Wall in the far North."
    },
    {
      "id": "3",
      "image": "https://m.media-amazon.com/images/I/81YyraOaX1L._AC_UY327_FMwebp_QL65_.jpg",
      "title": "The Lord of the Rings",
      "genre": "Fantasy , Adventure",
      "author": "J. R. R. Tolkien ",
      "rating": "⭐⭐⭐⭐⭐ ",
      "price": 359,
      "series": "The Lord of the Rings",
      "publisher": "George Allen & Unwin (UK) / Houghton Mifflin (US)",
      "pages": "398 pages",
      "description": "The Fellowship of the Ring is the first book in J.R.R. Tolkien's epic fantasy trilogy, The Lord of the Rings. It follows the journey of a young hobbit named Frodo Baggins as he sets out on a perilous quest to destroy the One Ring, an evil artifact crafted by the Dark Lord Sauron. Frodo is joined by a diverse fellowship of creatures, including elves, dwarves, men, and other hobbits, as they traverse Middle-earth to prevent the return of darkness."
    },
    {
      "id": "4",
      "image": "https://rukminim2.flixcart.com/image/612/612/l1mh7rk0/book/y/8/6/the-hobbit-original-imagd5phsmwyvbek.jpeg?q=70",
      "title": "The Hobbit",
      "genre": "Fantasy , Adventure",
      "author": "Tolkien J. R. R.",
      "rating": "⭐⭐⭐⭐⭐ ",
      "price": 357,
      "series": "The Lord of the Rings",
      "publisher": "George Allen & Unwin (UK) / Houghton Mifflin (US)",
      "pages": "310 pages",
      "description": "The Hobbit is a classic fantasy novel by J.R.R. Tolkien. It tells the story of Bilbo Baggins, a hobbit who is unexpectedly swept into an adventure with a group of dwarves seeking to reclaim their homeland from a fearsome dragon named Smaug. Throughout their quest, Bilbo encounters fantastical creatures and battles various challenges, ultimately discovering courage and resourcefulness he never knew he possessed."
    },
    {
      "id": "5",
      "image": "https://rukminim2.flixcart.com/image/612/612/l2hwwi80/book/z/v/a/empire-of-the-vampire-original-imagdt9pkdcvadur.jpeg?q=70",
      "title": "Empire of the Vampire",
      "genre": "Dark Fantasy , Horror",
      "author": "Kristoff Jay",
      "rating": "⭐⭐⭐⭐⭐ ",
      "price": 639,
      "series": "Empire of the Vampire (Book 1)",
      "publisher": "St. Martin's Press",
      "pages": "768 pages",
      "description": "Empire of the Vampire is a dark fantasy novel by Jay Kristoff. The story is set in a world ruled by vampires, and it follows Gabriel de León, the last of the Silversaint bloodline, on a quest to end the vampire lord's reign of terror. Fueled by revenge and driven by the memories of a lost love, Gabriel must confront his past and the secrets that hold the key to defeating the vampire empire."
    },
    {
      "id": "6",
      "image": "https://m.media-amazon.com/images/I/81m1s4wIPML._AC_UY327_FMwebp_QL65_.jpg",
      "title": "Harry Potter",
      "genre": "Magic, fantasy",
      "author": "J.K. Rowling",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 323,
      "series": "Harry Potter",
      "publisher": "Bloomsbury (UK) / Scholastic (US)",
      "pages": "223 pages",
      "description": "Harry Potter and the Philosopher's Stone (also known as Harry Potter and the Sorcerer's Stone in the US) is the first book in J.K. Rowling's immensely popular Harry Potter series. It follows the journey of a young wizard, Harry Potter, as he discovers his magical heritage and attends Hogwarts School of Witchcraft and Wizardry. Harry's adventures begin when he receives a letter inviting him to study at the magical school, uncovering his connection to the wizarding world and the dark history of Lord Voldemort."
    },
    {
      "id": "7",
      "image": "https://m.media-amazon.com/images/I/81f7bXC-tTL._AC_UY327_FMwebp_QL65_.jpg",
      "title": "Harry Potter",
      "genre": "Magic , Fantasy",
      "author": "J.K. Rowling",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 379,
      "series": "Harry Potter",
      "publisher": "Bloomsbury (UK) / Scholastic (US)",
      "pages": "317 pages",
      "description": "Harry Potter and the Prisoner of Azkaban is the third book in J.K. Rowling's Harry Potter series. In this installment, Harry Potter and his friends face new challenges, including the escape of the dangerous wizard Sirius Black from Azkaban prison. As Harry delves into the truth behind Sirius's alleged crimes, he also discovers powerful secrets about his own past and the existence of magical creatures called Dementors."
    },
    {
      "id": "8",
      "image": "https://m.media-amazon.com/images/I/511FzUmt8kL._SX329_BO1,204,203,200_.jpg",
      "title": "Six of Crows",
      "genre": "Fantasy, Young Adult",
      "author": "Leigh Bardugo",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 674.38,
      "series": "Shadow and Bone",
      "publisher": "Not provided",
      "pages": "465 pages",
      "description": "In the bustling city of Ketterdam, a band of outcasts, known as the Six of Crows, takes on an impossible heist that could bring them immense wealth and power. Each member possesses unique skills and secrets, but they must learn to trust one another as they navigate deadly adversaries and the complexities of their own dark pasts."
    },
    {
      "id": "9",
      "image": "https://m.media-amazon.com/images/I/51Ft0+h7YJL._SX326_BO1,204,203,200_.jpg",
      "title": "Daughter Of The Moon God",
      "genre": "Fantasy, Mythology",
      "author": " Sue Lynn Tan",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 699,
      "series": "Celestial Kingdom",
      "publisher": "Not provided",
      "pages": "- pages",
      "description": "Born under a divine prophecy, the protagonist, the Daughter of the Moon God, struggles to find her place in a world where gods and mortals clash. With celestial powers lying dormant within her, she embarks on an epic journey to understand her destiny and bring balance to the celestial realms and the earthly realm."
    },
    {
      "id": "10",
      "image": "https://m.media-amazon.com/images/I/51P3NRcaQ1L._SX324_BO1,204,203,200_.jpg",
      "title": "Twin Crowns",
      "genre": "Fantasy, Adventure",
      "author": " Catherine Doyle",
      "rating": "⭐⭐⭐⭐⭐",
      "price": "389",
      "series": "Twin Crown",
      "publisher": "Not provided",
      "pages": "- pages",
      "description": "In the kingdom of Eloria, a prophecy foretells the return of twin heirs to the throne, both bearing a birthmark of crowns. As the kingdom teeters on the edge of war, the twins, separated at birth and raised in vastly different worlds, must come together to claim their rightful place and save their realm from impending doom."
    },
    {
      "id": "11",
      "image": "https://m.media-amazon.com/images/I/51cr2A0263L._SX324_BO1,204,203,200_.jpg",
      "title": "Samsara",
      "genre": "Fantasy, Supernatural",
      "author": "Saksham Garg",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 151,
      "series": "samsara",
      "publisher": "Not provided",
      "pages": "- pages",
      "description": "Samsara follows the cyclical journey of a soul through reincarnations in various lifetimes. This spiritual odyssey explores the concept of karma, enlightenment, and the pursuit of liberation from the eternal cycle of birth and death."
    },
    {
      "id": "12",
      "image": "https://m.media-amazon.com/images/I/51fEGVcqErL._SX324_BO1,204,203,200_.jpg",
      "title": "Twelve and the Frozen Forest",
      "genre": "Fantasy, Adventure",
      "author": "Aisling Fowler",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 279,
      "series": "Fireborn",
      "publisher": "Not provided",
      "pages": "- pages",
      "description": "In a land plagued by an endless winter, a young boy named Twelve embarks on a courageous quest to save his village from the mysterious Frozen Forest. Armed with determination and the guidance of unlikely allies, he unravels the truth behind the curse and discovers his own inner strength."
    },
    {
      "id": "13",
      "image": "https://m.media-amazon.com/images/I/515J8wuPUyL._SX430_BO1,204,203,200_.jpg",
      "title": "One-Punch Man ",
      "genre": "Anime, Action, Comedy",
      "author": "One / Yusuke Murata",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 560.69,
      "series": "One Punch Man",
      "publisher": "Shueisha ",
      "pages": "200 pages",
      "description": "One-Punch Man follows the life of Saitama, a seemingly ordinary man who trained so hard that he can defeat any opponent with a single punch. Despite his unparalleled strength, he struggles to find fulfillment in the lack of challenging battles and yearns for a worthy adversary."
    },
    {
      "id": "14",
      "image": "https://m.media-amazon.com/images/I/51fbTU1F35L._SX331_BO1,204,203,200_.jpg",
      "title": "Eminence In Shadow",
      "genre": "Light Novel, Fantasy, Comedy",
      "author": "Daisuke Aizawa",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 911,
      "series": "Eminence In Shadow",
      "publisher": "Square Enix",
      "pages": "- pages",
      "description": " In this comedic isekai tale, a master strategist, hidden in the shadows, decides to create a fictional persona as the Emperor of Shadow to manipulate events in his favor. However, his carefully crafted fantasy becomes more real than he expected, leading to hilarious misunderstandings and unexpected consequences."
    },
    {
      "id": "15",
      "image": "https://m.media-amazon.com/images/I/51oboMqcwEL._SX430_BO1,204,203,200_.jpg",
      "title": "Your Name",
      "genre": "Anime, Romance, Drama",
      "author": " Makoto Shinkai ",
      "rating": "⭐⭐⭐⭐⭐",
      "price": 946,
      "series": "Your Name",
      "publisher": "Kadokawa",
      "pages": "192 pages",
      "description": "Your Name revolves around the inexplicable connection between two teenagers, a girl living in rural Japan and a boy in bustling Tokyo. Through dreams and body-swapping experiences, they form a deep bond and embark on a quest to unravel the mystery behind their extraordinary connection."
    }

  ]
}